<a href="https://colab.research.google.com/github/smrutipunto/NGDB/blob/main/Practical_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#DDL Statements
-- Create table CUSTOMERS
CREATE TABLE CUSTOMERS (
    CustId VARCHAR(50) PRIMARY KEY,
    Name VARCHAR(50),
    Contact_no VARCHAR(10)
);

-- Create table MOVIE
CREATE TABLE MOVIE (
    MovieID VARCHAR(50) PRIMARY KEY,
    Name VARCHAR(50),
    ActorName VARCHAR(50),
    ActressName VARCHAR(50),
    DirectorName VARCHAR(50),
    ReleaseDate DATE,
    CountryName VARCHAR(50),
    Price DECIMAL(9, 2)
);

-- Create table SCREEN
CREATE TABLE SCREEN (
    ScreenID VARCHAR(50) PRIMARY KEY,
    Name VARCHAR(50),
    MovieID VARCHAR(50),
    Capacity VARCHAR(50),
    FOREIGN KEY (MovieID) REFERENCES MOVIE(MovieID)
);

-- Create table TICKETS
CREATE TABLE TICKETS (
    TicketID VARCHAR(50) PRIMARY KEY,
    MovieID VARCHAR(50),
    ScreenID VARCHAR(50),
    Date DATE,
    Price DECIMAL(9, 2),
    FOREIGN KEY (MovieID) REFERENCES MOVIE(MovieID),
    FOREIGN KEY (ScreenID) REFERENCES SCREEN(ScreenID)
);

-- Insert records into tables

-- Insert records into CUSTOMERS table
INSERT INTO CUSTOMERS (CustId, Name, Contact_no) VALUES
('C001', 'John', '9834567890'),
('C002', 'Jane', '9845678901'),
('C003', 'David', '9856789012'),
('C004', 'Emily', '9867890123'),
('C005', 'Michael', '9878901234');

-- Insert records into MOVIE table
INSERT INTO MOVIE (MovieID, Name, ActorName, ActressName, DirectorName, ReleaseDate, CountryName, Price)
VALUES ('M001', 'The Great Adventure', 'Brad Pitt', 'Angelina Jolie', 'Steven Spielberg', '2025-02-15', 'USA', 15.99),
       ('M002', 'Sci-Fi Future', 'Will Smith', 'Halle Berry', 'James Cameron', '2025-04-20', 'UK', 18.50),
       ('M003', 'Action Time', 'Chris Hemsworth', 'Scarlett Johansson', 'Joss Whedon', '2025-06-10', 'Australia', 20.00),
       ('M004', 'Comedy Nights', 'Ben Stiller', 'Jennifer Aniston', 'Todd Phillips', '2025-07-05', 'Canada', 12.99),
       ('M005', 'Drama Life', 'Leonardo DiCaprio', 'Emma Stone', 'Martin Scorsese', '2025-08-22', 'Italy', 14.50);

-- Insert records into SCREEN table
INSERT INTO SCREEN (ScreenID, Name, MovieID, Capacity)
VALUES ('S001', 'Screen 1', 'M001', '200'),
       ('S002', 'Screen 2', 'M002', '150'),
       ('S003', 'Screen 3', 'M003', '300'),
       ('S004', 'Screen 4', 'M004', '120'),
       ('S005', 'Screen 5', 'M005', '250');

-- Insert records into TICKETS table
INSERT INTO TICKETS (TicketID, MovieID, ScreenID, Date, Price)
VALUES
('T001', 'M001', 'S001', '2025-01-06', 15.50),
('T002', 'M002', 'S002', '2025-01-06', 18.50),
('T003', 'M003', 'S003', '2025-01-06', 20.00),
('T004', 'M004', 'S004', '2025-01-06', 12.50),
('T005', 'M005', 'S005', '2025-01-06', 14.50);

-- Select data from the tables

SELECT * FROM CUSTOMERS;
SELECT * FROM MOVIE;
SELECT * FROM TICKETS;
SELECT * FROM SCREEN;

delete from tickets;

SELECT * FROM TICKETS;